dcustura/cyd-morse-trainer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# ESP32-2432S028R (Cheap Yellow Display): 4MB flash, custom partition table
# (see partitions.csv) since LVGL + esp_lcd + touch driver code is close to
# the default ~1MB factory app partition ceiling.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# paddle_input's keyer-sampling task needs genuine 1ms granularity
# (vTaskDelay(pdMS_TO_TICKS(1))); the default 100Hz tick makes pdMS_TO_TICKS(1)
# round down to 0, turning the delay into a no-op that starves the idle task
# and trips the watchdog.
CONFIG_FREERTOS_HZ=1000

# Fixed-width font used for the Practice screen's decoded text when "Small"
# text size is selected (see main/fonts.h for the custom font used for
# "Large").
CONFIG_LV_FONT_UNSCII_8=y

# Proportional font used for the Settings screen's numeric popup/tile value
# labels.
CONFIG_LV_FONT_MONTSERRAT_12=y

# The Practice screen's decoded-text area accumulates a long, spaceless run
# of characters between word gaps; LVGL's default (0 = disabled) never
# force-breaks a "word" regardless of length, so that whole run refuses to
# wrap until the next space. Break within any run longer than 1 character
# instead, so lines fill the display width like a plain character grid.
CONFIG_LV_TXT_LINE_BREAK_LONG_LEN=1
CONFIG_LV_TXT_LINE_BREAK_LONG_PRE_MIN_LEN=1
CONFIG_LV_TXT_LINE_BREAK_LONG_POST_MIN_LEN=1

# Redraw at ~60fps instead of LVGL's default ~30fps (33ms). The SPI clock
# (see display_init.c) and draw buffer size are the other limits on actual
# paint throughput; this just lets LVGL invalidate/flush more often.
CONFIG_LV_DEF_REFR_PERIOD=16

# BLE HID keyboard output (main/ble_hid_output.c): NimBLE instead of
# Bluedroid, since this device only ever needs a peripheral BLE HID role and
# NimBLE's footprint is far smaller than Bluedroid's combined classic+BLE
# stack -- this board is already tight on flash/SRAM with LVGL + touch.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HID_SERVICE=y
# Bonds must survive a restart, or a paired phone/PC has to re-pair every
# power cycle; this feature is meant to be enabled once and left alone.
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# This device only ever accepts one central (phone/PC) and never itself
# scans/connects out, so the Central and Observer roles and their GATT
# client support are pure overhead -- disabling them, and trimming
# connection/report-instance counts to what a single-instance keyboard
# actually needs, matters because the onboard DAC's DMA-based sidetone
# synth (main/sidetone.c) competes with the BT stack for the same limited
# internal DMA-capable RAM; measured on real hardware, the untrimmed
# defaults left too little for sidetone_init() to allocate its DMA buffer,
# aborting the boot as soon as BLE HID output was turned on.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BTDM_CTRL_BLE_MAX_CONN=1
# esp_hid's NimBLE HID-device backend (components/esp_hid/src/nimble_hidd.c)
# calls the Battery Service API unconditionally, so BAS_SERVICE can't be
# turned off even though this device doesn't report a battery level.
CONFIG_BT_NIMBLE_SVC_HID_MAX_INSTANCES=1
CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=2
